# Import libraries and read data

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('data.csv')

In [4]:
df.head()

     x1  x2    x3    x4  x5  x6
0  10.0   1   NaN   7.0   3   2
1  20.0  12   5.0  12.0   4   5
2   NaN   5   NaN  12.0   3   6
3  40.0   1   NaN   3.0  44   0
4  50.0   2  12.0   7.0   3   1

In [5]:
df.dtypes

x1    float64
x2      int64
x3    float64
x4    float64
x5      int64
x6      int64
dtype: object

# Check for Nulls in columns [DROP]

In [6]:
df.shape

(33, 6)

In [7]:
df.isnull().sum()

x1     1
x2     0
x3    18
x4     2
x5     0
x6     0
dtype: int64

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x1      32 non-null     float64
 1   x2      33 non-null     int64
 2   x3      15 non-null     float64
 3   x4      31 non-null     float64
 4   x5      33 non-null     int64
 5   x6      33 non-null     int64
dtypes: float64(3), int64(3)
memory usage: 1.7 KB

In [9]:
missing_data = pd.DataFrame({'total_missing': df.isnull().sum(), 'perc_missing': (df.isnull().mean())*100})
missing_data

    total_missing  perc_missing
x1              1      3.030303
x2              0      0.000000
x3             18     54.545455
x4              2      6.060606
x5              0      0.000000
x6              0      0.000000

In [10]:
# Column 3 has 54% missing values so let's drop it
newdf = df.drop(columns=['x3'])

In [11]:
newdf.head()

     x1  x2    x4  x5  x6
0  10.0   1   7.0   3   2
1  20.0  12  12.0   4   5
2   NaN   5  12.0   3   6
3  40.0   1   3.0  44   0
4  50.0   2   7.0   3   1

# Check for Nulls in columns [FILL]

In [16]:
df.head()

     x1  x2    x3    x4  x5  x6
0  10.0   1   NaN   7.0   3   2
1  20.0  12   5.0  12.0   4   5
2   NaN   5   NaN  12.0   3   6
3  40.0   1   NaN   3.0  44   0
4  50.0   2  12.0   7.0   3   1

In [12]:
newdf.to_csv('output.csv')